{
  "speech": [
    {
      "conditions": {
        "relation": "friendly"
      },
      "lines": [
        "Будьте настороже. В этих краях полно разбойников",
        "Ночью разбивайте лагерь в безопасных местах и держитесь подальше от теней",
        "Мы, Дунэдайн, храним древние знания Запада. Мы умеем оставаться незамеченными",
        "Остерегайтесь мерзких моргульских отродий, которые выползают по ночам",
        "Варг, которого лишь слышишь, страшнее орка, которого страшишься",
        "Будьте осторожны, в это страшное время на каждом шагу подстерегают опасности",
        "Одинокий народ мы, следопыты, охотники, - но всегда охотники на слуг Врага.",
        "Слуги врага встречаются во многих местах, не только в Мордоре",
        "В трудную минуту мы придем на помощь наследнику Исилдура",
        "За последнее время мы потеряли большую часть нашего отряда",
        "Люди запада колеблются, но пока я дышу, я буду защищать наш народ",
        "В этой глуши небезопасно, никогда не знаешь, когда на тебя охотятся",
        "Будь осторожен в глухомани",
        "В последнее время ветер дует в спину",
        "Какие вести ты принес?",
        "Мрак опускается на эти земли",
        "Я своими глазами видел руины Аннуминаса, когда-то там была наша столица",
        "В глубине души, #p, я все еще мечтаю о том дне, когда Дунэдайн объединятся",
        "О, как бы я хотел, чтобы мы увидели Арнор во всем его великолепии - сейчас здесь только руины и гробницы"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "weather": "rain | snow"
      },
      "lines": [
        "Пусть твой плащ укроет тебя от дождя, #p.",
        "Дикие земли могут быть суровыми и неумолимыми",
        "Погода может быть неприятной, но орки еще более мерзкие",
        "Я надеюсь, что небо скоро прояснится",
        "Погода может быть сырой и холодной, но, тем не менее, она помогает укрыться от невидимых врагов",
        "Солнце скрылось, и мерзкие создания тьмы вновь выползли из своих нор"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "rank": ">=captain"
      },
      "lines": [
        "Рад познакомиться с капитаном #p!",
        "Приветствую, капитан!",
        "Какие новости вы принесли, #p?"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:lone_lands | lotr:eriador | lotr:hills_of_evendim | lotr:eriador_downs | lotr:lone_lands_hills | lotr:minhiriath | lotr:enedwaith",
        "rank": "<=warden"
      },
      "lines": [
        "Ты ведь не вражеский шпион, не так ли?",
        "Присоединишься ли ты к нам в нашей борьбе с вражескими отродьями, заполонившими эти земли",
        "Мы знакомы слишком мало, чтобы я доверял тебе. В этих краях полно шпионов",
        "Настали темные времена, никогда не знаешь, кому можно доверять",
        "Ты друг или враг?"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:lone_lands | lotr:eriador | lotr:hills_of_evendim | lotr:eriador_downs | lotr:lone_lands_hills | lotr:minhiriath | lotr:enedwaith"
      },
      "lines": [
        "Мой род издавна охранял эти земли от опасностей",
        "Пока мы охраняем эти земли, путешественники, подобные вам, могут ходить тут спокойно",
        "Остерегайтесь древних духов, которые бродят по этой земле. Говорят, они могут завладеть вашим телом",
        "Наши дома находятся здесь, на Севере",
        "Будьте осторожны в окресностях Эттенмурса, тролли спускаются с гор",
        "Если бы не мы, эти земли пали бы давным-давно.",
        "Эти земли - мои владения, и я делаю все, что в моих силах, чтобы защитить их",
        "Мы не зря следим за этими землями. Здесь гнездится множество мерзких тварей",
        "Что привело вас в эту дикую местность?",
        "Мы, следопыты, охраняли эти земли на протяжении многих поколений, память о которых стерлась",
        "Мы долго охраняли эти земли",
        "Наше некогда великое королевство правило этими землями",
        "Давным-давно наш народ жил на этих землях, теперь же мы рассеяны по миру, а от городов остались одни руины",
        "Только мы помним славу Арнора",
        "Наш народ веками защищал эти земли",
        "Раньше здесь было королевство Арнор, а теперь мы - все, что осталось от некогда великого народа",
        "В древности эти земли были великим королевством, но те дни давно прошли...",
        "Никто, кроме нас, не помнит о великом народе, который давным-давно правил этими землями...",
        "Если вы направитесь на север по Зеленому тракту, то в конечном итоге окажетесь у руин Форноста."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:lone_lands_hills"
      },
      "lines": [
        "Вы видели руины Амон Сула? Они находятся к югу отсюда и отлично подходят для лагеря.",
        "Заверть находится к югу отсюда. В былые времена она была известна как сторожевая башня Амон Сула.",
        "Я слышал, что во времена Арнора в сторожевой башне Амон Сул когда-то хранился палантир. Он был утерян, когда король утонул вместе с ним в бухте Форхель."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:hills_of_evendim"
      },
      "lines": [
        "Некогда великий город Аннуминас был построен на этих холмах, он был первой столицей Королевства Арнор."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:shire | lotr:breeland | lotr:shire_woodlands | lotr:shire_moors | lotr:white_downs | lotr:chetwood"
      },
      "lines": [
        "Если бы не мы, эти земли давно погрузились бы во тьму",
        "Эти земли - мои владения, и я делаю все, что в моих силах, чтобы защитить их",
        "Мы долго охраняли эти земли",
        "Мы защищаем эти земли от теней",
        "Хоббиты, возможно, не особенно любят нас, но на расстоянии мы их защитники",
        "В этих краях видели всадников в черных плащах",
        "Мы упорно боремся за сохранение мира на этих землях",
        "Хоббиты живут простой жизнью под бдительным присмотром глаз Дунэдайн.",
        "Было трудно защищать эти земли с тех пор, как нас выгнали из Сарн-форда",
        "Эти люди не знают об опасности, набирающей силу их за пределами их земель",
        "Слуги врага проявляют большой интерес к этим землям"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:breeland | lotr:chetwood"
      },
      "lines": [
        "В Бри появились злые люди",
        "Не доверяйте разбойникам, бродящим по землям Бри",
        "Жители Бри опасаются нас, но мы не желаем им зла",
        "Многие из живущих здесь людей считают нас бандитами и изгоями. Они не знают наших истинных обязанностей"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:further_gondor | lotr:anorien | lotr:pinnath_gelin | lotr:anfalas | lotr:blackroot_vale | lotr:lamedon | lotr:pelargir | lotr:lossarnach | lotr:lebennin | lotr:emyn_en_ernil | lotr:dor_en_ernil"
      },
      "lines": [
        "Это земли наших сородичей, хотя многие из здешних жителей, похоже, забыли об этом",
        "Люди Гондора не слишком уважают нас, следопытов Севера",
        "Наместники Гондора не признают наследника Исилдура законным королем",
        "Королевства Дунэдайн севера и юга когда-то были едины, теперь новости об этих землях редко доходят до нас",
        "Люди Гондора - наша последняя защита от натиска Мордора",
        "Однажды наследник Исилдура будет править этими землями, и наш народ снова объединится.",
        "Я надеюсь на людей Гондора, которые противостоят армиям Мордора",
        "В Итилиене есть такие же гондорцы, как и мы, которые охраняют дикую местность",
        "Гондор. Южное королевство дунэдайн",
        "Гондор когда-то был близким союзником Арнора, пока наше королевство не пало"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:rivendell | lotr:rivendell_hills"
      },
      "lines": [
        "Лорд Элронд - радушный хозяин, который приветствует нас в своих землях",
        "Дунэдайн и эльфы Имладриса всегда были связаны тесными узами",
        "Ривенделл. Последний уютный дом эльфов к востоку от моря",
        "Немногие места в Средиземье могут сравниться по красоте с этим",
        "Эльфы Ривенделла очень гостеприимны",
        "Ривенделл является домом для многих реликвий нашего народа, таких как осколки Нарсила, меча, который отрезал кольцо с руки Саурона",
        "Многие из присутствующих здесь эльфов были свидетелями падения нашего королевства",
        "Хранители знаний Имладриса берегут много знаний о нуменорцах, наших предках",
        "Вам повезло, что вас радушно принимают в этих землях, #p.",
        "Элронд держит скипетр Аннуминаса, реликвию наших королей древности до прихода наследника Исилдура",
        "В Ривенделле есть много книг по истории древнего королевства Арнор."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:breeland | lotr:chetwood",
        "rank": ">=warden"

      },
      "lines": [
        "Я советую остановиться в гостинице Гарцующий пони, прежде чем возвращаться в дикую местность, #p",
        "Черные всадники, напавшие на Сарн-Форд, пришли сюда, в Бри, настали темные времена #p",
        "Будь осторожен, #p, Бри полон подозрительных людей",
        "Интересно, какой интерес у этих шпионов к Бри?",
        "В Бри приезжают негодяи с юга",
        "За нами наблюдают, не болтайте лишнего",
        "Говорят, что в последнее время Бри кишит шпионами"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "rank": ">=friend",
        "biome": "lotr:shire | lotr:breeland | lotr:shire_woodlands | lotr:shire_moors | lotr:white_downs | lotr:chetwood"
      },
      "lines": [
        "Долгое время мы защищали эти земли, #p",
        "Что привело вас в эту глушь?",
        "Мы не зря следим за этими землями, здесь обитает много мерзких тварей",
        "Пока мы охраняем эти земли, такие путешественники, как ты, смогут спокойно ходить здесь, #p.",
        "Остерегайтесь древних духов которые бродят по этой земле, #p. Говорят, они могут завладеть вашим телом",
        "Эти земли - мои владения, и я делаю все, что в моих силах, чтобы защитить их",
        "Здешние люди не знают, что находится за их границами",
        "Мы, следопыты, защищаем эти земли",
        "Я позабочусь о том, чтобы никакая опасность не проникла сюда"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "rank": ">=friend"
      },
      "lines": [
        "Пусть ваше путешествие будет быстрым, а плащ теплым",
        "Остерегайтесь мерзкого моргульского отродья, которое выползает по ночам",
        "Будьте осторожны, в эти темные дни возникло много новых опасностей",
        "Я рад узнать, что ты не прислужник врага, #p!",
        "Пусть твои шаги будут легкими, и плащ укроет тебя, #p."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "rank": ">=friend",
        "day_or_night": "day"
      },
      "lines": [
        "Добрый день, #p. Откуда ты прибыл?",
        "Добрый день, #p.!",
        "К ночи эти земли будут кишеть орками"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "rank": ">=warden"
      },
      "lines": [
        "Приятно познакомиться #p! Есть какие-нибудь новости?",
        "На Бри напали Черные всадники, те же, что напали на нас у брода Сарн. Настали темные времена",
        "Будьте осторожны, если отправитесь в Бри, в тех краях появились шпионы и разбойники",
        "Привет, #p, ты принес какие-нибудь новости о наших родичах?",
        "С каждым днем все больше орков спускается с гор",
        "Наш враг вернулся, #p.",
        "Ходят слухи, что орки заполонили Изенгард. Саруман предал нас",
        "В последнее время горцев на севере становится все больше",
        "Наш старый враг на севере растет",
        "Вы слышали какие-нибудь новости с юга?",
        "Будьте осторожны с нашими могилами, они прокляты"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "pledge": "lotr:rohan"
      },
      "lines": [
        "Всадник Рохана! Какие вести с севера?",
        "Ходят слухи, что орки, носящие знамя Белой длани, грабят ваши земли. Значит, это правда, что Саруман предал нас?",
        "Грабители и шпионы пробираются вверх по Гринуэю из ущелья Рохан и обосновываются в Бри, вы знаете об этом?",
        "Приветствую тебя, всадник Рохана",
        "Я слышал, что король Теоден потерял рассудок, это правда?"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "pledge": "lotr:high_elves | lotr:lothlorien | lotr:woodland_realm"
      },
      "lines": [
        "Рад встрече, #p.",
        "Привет! Какие новости от эльфов?",
        "Мае гованен, мой друг",
        "Я слышал, что один кусочек лембаса может наполнить желудок взрослого мужчины!",
        "Рассказы о черных всадниках ходили по всему Эриадору, я боюсь, что древние назгулы, возможно, вернулись",
        "Эльфы давно поддерживают наш народ",
        "Дунэдайн всегда рады встрече с эльфами",
        "Ты чувствуешь это? Ты чувствуешь, как тьма сгущается над Средиземьем?"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "pledge": "lotr:gondor"
      },
      "lines": [
        "Поддержишь ли ты наследника Исильдура, когда он вступит в эти земли?",
        "Рад встрече, #p! Какие новости о наших южных родственниках?",
        "Ходят слухи, что наемники с юга начали совершать набеги на побережье Гондора!",
        "Наместники не могут противостоять возвращению наследника Исилдура на трон.",
        "Вы видели осколки Нарсила? Они хранятся в Ривенделле",
        "Гондор - наш последний оплот против армий Мордора",
        "Мы - последняя память о Западе",
        "Вместе люди Запада противостоят слугам врага",
        "Рад встрече, как поживают южные Дунэдайн?",
        "Я слышал, что из Минас-Тирита открывается потрясающий вид",
        "Приветствую, #p! Как продвигается битва с Мордором?",
        "Я слышал, у следопытов Итилиена возникли проблемы с харадримами, что пришли с Юга"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "pledge": "lotr:lossoth"
      },
      "lines": [
        "Лоссот приютили последнего правителя нашего старого королевства, и мы благодарны им за это",
        "Приветствую вас! Как снежные люди Форохеля переносили суровые зимы?",
        "Следопыты привыкли к дикой природе, но жить в ледяных пустошах севера - очень храбро, #p",
        "Рад встрече, #p. Как поживают жители Фородвайта?",
        "Я слышал, народ Лоссота живёт в снежных хижинах, ваша стойкость в холодную зиму достойна уважения",
        "Без вашего народа Кольцо Барахира, семейная реликвия нашего рода, было бы утеряно в море",
        "Давным-давно ваш народ укрывал Арведуи, нашего последнего короля"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "pledge": "lotr:bree"
      },
      "lines": [
        "Не доверяй этим головорезам, #p. Они шпионы врага.",
        "Мы охраняем пустыню, окружающую ваши земли",
        "Не бойтесь наших людей, мы можем выглядеть угрожающе, но мы не причиним вам вреда",
        "Опасайтесь курганов, на наших древних могилах лежит страшное проклятие.",
        "Будьте осторожны в Бри, с юга приезжает много подозрительных людей",
        "Я слышал, что черные всадники были в Бри? Все гораздо хуже, чем ты можешь себе представить."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:mordor | lotr:mordor_mountains | lotr:gorgoroth | lotr:morgul_vale | lotr:angmar | lotr:angmar_mountains"
      },
      "lines": [
        "Я чувствую глубокий ужас в своем сердце, нам не следует здесь задерживаться",
        "Остерегайтесь мерзких моргульских отбросов, которые рыщут по этим землям",
        "Здесь небезопасно",
        "В этих землях рыщут слуги врага",
        "Эти земли окутаны неестественной тьмой",
        "Я бы не осмелился бродить здесь по своей воле, ты храбрее меня",
        "Враг погрузил бы всё Средиземье во тьму, подобную этой",
        "Эти земли кишат орками",
        "Это очень пугающее место, действуй осторожно",
        "Здесь дикая природа кажется такой привлекательной",
        "Я бы предпочел оказаться где угодно, только не в этих грязных землях",
        "Мне не следовало приходить в эти края",
        "Я горю желанием вернуться в дебри Эриадора",
        "Именно с этой тьмой мы клянёмся бороться",
        "Нам здесь не место, #p",
        "Воздух здесь ощущается ядовитым",
        "Я хочу бежать из этих проклятых земель"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "biome": "lotr:angmar | lotr:angmar_mountains"
      },
      "lines": [
        "Королевство Ангмар, наш древний враг.",
        "В былые времена король-чародей Ангмара командовал своими войсками из этих проклятых земель",
        "Я думал, что королевство Ангмар было заброшено, я был обескуражен, узнав, что враг вернулся",
        "Люди этих земель когда-то были частью нашего народа, а теперь они слуги врага"
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "hired": "own"
      },
      "lines": [
        "Мой долг перед моим капитаном #p и землями, которые я охраняю",
        "Отродье Моргула погибнет у нас на глазах!",
        "Я поклялся защищать земли свободных народов, и я буду защищать их!",
        "Пусть ваше путешествие будет быстрым, а плащ теплым, капитан #p",
        "К ночи эта земля будет кишеть орками",
        "Будьте настороже, капитан #p.. В этих краях много врагов",
        "Мы, следопыты, помним древние знания Запада. У нас есть способы оставаться незамеченными",
        "У нас, следопытов, есть способы передвигаться незамеченными",
        "Я последую за тобой, куда бы ты не отправился!",
        "У меня есть способы передвигаться незамеченным в тени",
        "Давай поохотимся на орков!",
        "Я сражаюсь за память о Западе, #p.",
        "Ты настоящий друг Дунэдайн, #p.",
        "Мы последуем за тобой сквозь смерть и разорение!",
        "Жалкие моргульские отбросы встретят наш гнев лицом к лицу!",
        "Гибель всем врагам Дунэдайн!",
        "Нам следует держаться в тени, #p."
      ]
    },
    {
      "conditions": {
        "relation": "friendly",
        "hired": "own",
        "biome": "lotr:lone_lands | lotr:eriador | lotr:hills_of_evendim | lotr:eriador_downs | lotr:lone_lands_hills | lotr:minhiriath | lotr:enedwaith"
      },
      "lines": [
        "Мои родичи долго охраняли эти земли",
        "Мы долго охраняли эти земли, капитан #p",
        "Мы, следопыты, охраняли эти земли на протяжении многих поколений, память о которых стерлась"
      ]
    },
    {
      "conditions": {
        "relation": "hostile",
        "biome": "lotr:lone_lands | lotr:eriador | lotr:hills_of_evendim | lotr:eriador_downs | lotr:lone_lands_hills | lotr:minhiriath | lotr:enedwaith"
      },
      "lines": [
        "Тебе не рады в этих землях, #p!",
        "Беги с наших земель, ты, жалкий союзник моргульской нечисти!",
        "Мы, следопыты, охраняли эти земли на протяжении многих забытых поколений, мы не позволим, чтобы они достались таким, как ты!",
        "Беги с этих земель, #p! Тебе здесь не рады!",
        "Я не оставлю эти земли без охраны. Уноси ноги, погань",
        "Эти земли охраняются последним из Дунэдайн!",
        "Убирайтесь с этих земель!"
      ]
    },
    {
      "conditions": {
        "relation": "hostile",
        "biome": "lotr:shire | lotr:breeland | lotr:shire_woodlands | lotr:shire_moors | lotr:white_downs | lotr:chetwood"
      },
      "lines": [
        "Я не позволю вам причинить вред свободному народу этих земель!",
        "Я буду защищать жизнь этого народа до последнего вздоха!",
        "Хоббиты не потерпят вашего предательства!",
        "Эти земли - мои владения! Я сделаю все, что в моих силах, чтобы защитить их!",
        "Не думайте, что эти земли не защищены, #p!",
        "Эти земли охраняются следопытами Севера!"
      ]
    },
    {
      "conditions": {
        "alternatives": [
          {
            "relation": "hostile"
          }
        ]
      },
      "lines": [
        "Наш народ может быть разделен, но мы вместе выступаем против таких как ты!",
        "Возвращайся в свою жалкую дыру, слуга врага!",
        "Мы не позволим угаснуть памяти о Западе!",
        "Люди запада выступают против вас!",
        "Ваша смерть будет быстрой, как стрела, пронзающая плоть!",
        "Я покончу с вами!",
        "По вам никто не будет скучать!",
        "Ты враг нашего народа, #p!",
        "Тебе тут делать нечего!",
        "Убирайся обратно в темноту, #p!",
        "Ты думал, что сможешь сравниться с нами в мастерстве? Ты жестоко ошибаешься!",
        "Когда #p отказался от разума ради безумия?",
        "Твоя судьба близка, #p!",
        "Не стоит недооценивать Рейнджеров Севера",
        "Возвращайся во тьму, откуда ты пришел!",
        "Что за дьявольщину Темного Лорда ты принес сюда?",
        "Ты быстро встретишь свою смерть, отродье Мордора!"
      ]
    }
  ]
}