{
  "speech": [
    {
      "conditions": {
        "relation": "friendly"
      },
      "lines": [
        "#p. Я вижу, твои карманы набиты ненужным мусором! Позволь мне заменить его на пару монет!",
        "Отдай мне свой бесполезный хлам в обмен на серебро!",
        "Ты выглядишь так будто в твоих карманах есть ненужные безделушки, #p!",
        "У меня лучшие цены в этих землях!",
        "В последнее время торговля идет медленно. Возможно, вы могли бы мне помочь",
        "Не задавай вопросов! Отдай мне свой мусор",
        "Серебро за твой мусор, без вопросов!",
        "Ржавый метал не принимается.",
        "Не хотите подзаработать, #p?",
        "Я мог бы наполнить твой кошелек монетами всего за пару мелочей.",
        "В этих диких землях когда-то царил ужас, но теперь его нет и в помине.",
        "Может быть, однажды у меня будут золотые залы, которым позавидуют даже гномы!",
        "Говорят, у орков из Гундабада много золота, так что, возможно, я отправлюсь туда в следующий раз.",
        "Ты кажешься мне надежным человеком, #p. Хочешь помочь старику и поторговаться со мной?",
        "Свинец, олово, медь, сталь. Торгуй со мной и получи серебро, возможно вам даже хватит на еду!",
        "Я в бизнесе уже давно, и я узнаю клиента, когда вижу его, эй, #p!",
        "Некоторые называют меня мошенником, но я думаю, что они мне просто завидуют",
        "Странности - мой товар, серебро - моя зарплата. Обменяйте свой хлам на хорошее настроение!",
        "Из нас, купцов, получаются хорошие поэты. Продай мне что-нибудь, и я сочиню тебе стишок",
        "А знаешь, я ведь и с королями торговал, #p.",
        "Все, что мне нужно, это немного металла. Продай мне меч, котелок, сковороду, кастрюлю и чайник!",
        "Ох, #p. Я с радостью обменяю этот мусор у тебя на пару монет",
        "#p! Вы пришли договориться о сделке?",
        "Признаю, я прекрасный торговец!",
        "Я хожу по многим дорогам и зажигаю много костров, но от торговли странностями устать невозможно.",
        "#p. Торговля - мое топливо!",
        "#p. Сделки по мусору - это мой конёк!",
        "Я считаю себя лучшим в торговле металлоломом. Торгуйте со мной, и узнаете почему",
        "Хотя мой любимый металл - золото, немного ржавого лома никогда не будет лишним",
        "Говоря о металлах, свинец - самый дешевый",
        "Я мечтаю о красивых одеяниях, тёплом очаге и несметных богатствах",
        "Я чувствую мусор!",
        "Хочешь подзаработать? Я мог бы дать тебе монетку в обмен на твой хлам!",
        "Я бы не отказался от эля. Ты тоже? Почему нет! Я могу поделиться монетой, чтобы ты купил ещё!",
        "Ты знаешь, куда обратиться, если тебе когда-нибудь понадобится избавиться от этого хлама, #p",
        "Тебе не нужен этот мусор, #p. Я заберу его, а в обмен дам тебе серебро!",
        "Я приму даже половину меча, если это все, что у тебя есть",
        "Просто отдай мне свой мусор!",
        "Я могу определить металл на вкус... Любой металл!",
        "Мои стихи так же прекрасны, как и мои сделки",
        "Поторгуй со мной, #p!",
        "Принеси мне мусор, и я наполню твой кошелек доверху!",
        "Что? Нет, конечно! У меня нет никаких зловещих скрытых мотивов покупать у тебя весь этот мусор...",
        "Что я делаю со всем этим мусором, который я покупаю? Это не твое дело, друг!",
        "Тебя посетил торговец странностями! К тебе придут великие богатства и удача, но только если ты скажешь: Спасибо, мистер торговец!",
        "Твоё явление было предречено, #p. И еще было предсказано, что ты продашь мне немного того мусора, что у тебя есть!",
        "Торгуй со мной, или я украду твою дочь, когда ты будешь отдыхать в Хараде!",
        "Для кого-то это отбросы, но для меня это сокровище..",
        "Больше мусора Богу мусора!",
        "И с этим мусором, который ты мне продашь, мой план завершится! Оу, привет #p",
        "Некоторые говорят, что с древних времен существуют духи-убийцы, которые могут принимать облик любого. Даже торговца странностями.",
        "#p, ты выглядишь как бедняга, которому повезло наткнуться на возможность чрезвычайно выгодной сделки со мной!",
        "Что для одного мусор, для другого - сокровище!",
        "Мусор вреден для здоровья! Отдай его мне!",
        "Если ты не отдашь мне весь свой мусор, то я прокляну Солнце, чтобы оно не взошло завтра! Ха-ха!",
        "Мы, коллекционеры мусора, бродим по миру в поисках всякого хлама! Я думаю ты можешь помочь мне в этом!",
        "Все идет по моему плану!",
        "У всего есть цена, даже у твоей жизни."
      ]
    },
    {
      "conditions": {
        "alternatives": [
          {
            "relation": "hostile"
          }
        ]
      },
      "lines": [
        "Я больше никогда не буду иметь с тобой дело!",
        "Проваливай, #p!",
        "Прочь, хулиган!",
        "Я привык к таким бандитам, как ты!",
        "Ты мешаешь торговле!",
        "Я не собираюсь заканчивать торговлю",
        "Пусть твой клинок вечно ржавеет!",
        "Я никогда не куплю твой хлам!",
        "Проклинаю тебя!",
        "Я не торгую с бандитами!",
        "Ты самый гадкий из тех кого я встречал за всю свою жизнь, #p!",
        "Хоть я и простой торговец, но я не трус!",
        "Ты не увидишь рассвет, #p!",
        "Ты идиот, #p!",
        "Мне стыдно думать, что я бы торговал с тобой, #p!",
        "Не подходи ко мне, #p!",
        "Я проклинаю тебя!",
        "Твое золото - фальшивка, #p!",
        "Прочь, #p!",
        "Я надеюсь что больше никогда не увижу тебя, #p!",
        "Ты сгниешь в одиночистве, #p!",
        "Я буду плевать на твою могилу!",
        "Ты бросаешь мне вызов, #p?",
        "Я проклинаю тебя, #p!",
        "Прокляну тебя на бедность!",
        "Я проклинаю твое имя!",
        "Ты обычный негодяй, #p! Прочь!",
        "Даже не думай о торговле со мной!",
        "Прочь, негодяй!",
        "Отойди от меня! Хулиган!",
        "Ты обычный бандит! Прочь отсюда!"
      ]
    }
  ]
}